c5/src/Documents/OutgoingEmail/OutgoingEmail.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>OutgoingEmail</name>
  <attributes>
    <name>AttachmentsCount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Brief</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Cc</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Importance</name>
    <type>
      <types>EnumRef.Importance</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomingEmail</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Key</name>
    <type>
      <types>CatalogRef.MailKeys</types>
    </type>
  </attributes>
  <attributes>
    <name>Mailbox</name>
    <type>
      <types>CatalogRef.Mailboxes</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Receiver</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReceiverName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReplyTo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sender</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SenderName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerMessageID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Subject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Table</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>TableDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TableType</name>
    <type>
      <types>EnumRef.TableTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Attachments</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Extension</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>File</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Size</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Emails</name>
    <attributes>
      <name>Email</name>
      <type>
        <types>DocumentRef.IncomingEmail</types>
        <types>DocumentRef.OutgoingEmail</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/CommonModules/Emails/Module.bsl
Procedure OpenLink ( EventData, StandardProcessing, Mailbox, Email ) export
	
	command = getCommand ( EventData );
	if ( command = undefined ) then
		linkProcessing ( EventData, StandardProcessing, Mailbox );
	else
		doCommand ( command, Email );
	endif;
	
EndProcedure 

Function getCommand ( EventData )

	if ( EventData.Element.id = "" ) then
		return undefined;
	endif; 
	data = Conversion.StringToArray ( EventData.Element.id, "#" );
	command = new Structure ();
	command.Insert ( "Name", data [ 0 ] );
	command.Insert ( "Parameter", ? ( data.Count () = 1, undefined,  data [ 1 ] ) );
	return command;
	
EndFunction 

Procedure linkProcessing ( EventData, StandardProcessing, Mailbox )
	
	link = adjustHref ( EventData.Href );
	if ( link = undefined ) then
		return;
	endif;
	mailTo = Lower ( Left ( Link, 7 ) );
	if ( mailTo = "mailto:" ) then
		StandardProcessing = false;
		openNewEmail ( Mid ( link, 8 ), Mailbox );
	else
		details = EmailsSrv.LinkDetails ( link );
		if ( details.IsInternal ) then
			StandardProcessing = false;
			if ( details.Commands = undefined ) then
				GotoURL ( link );
			else
				cmd = details.Commands;
				if ( cmd.Property ( "c1" ) ) then
					renewTenantOrder ( cmd.c1 );
				endif;
			endif; 
		endif; 
	endif; 
	
EndProcedure 

Function adjustHref ( Href )
	
	if ( Href <> undefined
		and StrStartsWith ( Href, "about:" ) ) then
		return Mid ( Href, 7 ); // StrLen ( "about:" )
	endif;
	return Href;
	
EndFunction

Procedure openNewEmail ( Address, Mailbox )
	
	values = new Structure ();
	values.Insert ( "Receiver", Address );
	values.Insert ( "Mailbox", Mailbox );
	OpenForm ( "Document.OutgoingEmail.ObjectForm", new Structure ( "FillingValues", values ) );
	
EndProcedure 

Procedure renewTenantOrder ( OrderNumber )
	
	if ( CloudPayments.UserCanPay () ) then
		p = new Structure ( "FillingValues", new Structure () );
		p.FillingValues.Insert ( "RenewTenantOrder", OrderNumber );
		OpenForm ( "Document.TenantOrder.ObjectForm", p );
	else
		Output.TenantOrderAccessError ( ThisObject );
	endif; 
	
EndProcedure 

Procedure doCommand ( Command, Email )
	
	if ( Command.Name = Enum.EmailBodyDownload ()
		or Command.Name = Enum.EmailBodyOpen () ) then
		data = EmailsSrv.GetFileData ( Number ( Command.Parameter ), Email );
		p = Attachments.GetParams ();
		if ( Command.Name = Enum.EmailBodyDownload () ) then
			p.Command = Enum.AttachmentsCommandsDownload ();
		else
			p.Command = Enum.AttachmentsCommandsShow ();
		endif; 
		p.FolderID = data.MessageID;
		p.Mailbox = data.Mailbox;
		p.Ref = Email;
		p.Files = new Array ();
		p.Files.Add ( data.File );
		Attachments.Command ( p );
	endif; 
	
EndProcedure 

Procedure ProcessLink ( EventData, StandardProcessing ) export
	
	link = adjustHref ( EventData.Href );
	if ( link = undefined ) then
		return;
	endif;
	details = EmailsSrv.LinkDetails ( link );
	if ( details.IsInternal ) then
		StandardProcessing = false;
		GotoURL ( link );
	endif;
	
EndProcedure
